{"format": "graph-model", "generatedBy": "2.0.0-beta1", "convertedBy": "TensorFlow.js Converter v1.1.2", "modelTopology": {"node": [{"name": "input_1", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "64"}, {"size": "64"}, {"size": "3"}]}}}}, {"name": "conv2d_5/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_8/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "90"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_5/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_8/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_6/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_6/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_9/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_9/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_7/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_7/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "local_delta_stage3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_8/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "16"}]}}}}}, {"name": "local_delta_stage3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_8/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pred_a/strided_slice_15/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "pred_a/strided_slice_15/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "conv2d_9/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pred_a/strided_slice_15/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d_9/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "flatten_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "flatten_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "flatten_1/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pred_age_stage3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pred_age_stage3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_3/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}}}, {"name": "pred_a/add_17/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pred_a/strided_slice_17/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "conv2d_4/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_4/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_10/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_10/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pred_a/add_19/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_3/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "6"}]}}}}}, {"name": "pred_a/strided_slice_19/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "dense_3/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}}}, {"name": "pred_age_stage1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pred_age_stage1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pred_a/mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "local_delta_stage1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "local_delta_stage1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pred_a/mul_10/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "delta_s1/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "delta_s1/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_11/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_11/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_4/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "90"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_4/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_12/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_12/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_5/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "90"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_5/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_6/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_6/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "local_delta_stage2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "local_delta_stage2/bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "pred_age_stage2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "6"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pred_age_stage2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "delta_s2/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "90"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "delta_s2/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_13/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "10"}]}}}}}, {"name": "conv2d_13/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "dense_7/kernel", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "90"}, {"size": "3"}]}}}}}, {"name": "dense_7/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "delta_s3/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "90"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_14/kernel", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "pred_a/mul_33/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_14/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "delta_s3/bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_4/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_8/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_8/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_7/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_7/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_6/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_6/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/FusedBatchNorm/Scaled", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/FusedBatchNorm/Offset", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "conv2d_5/Conv2D", "op": "Conv2D", "input": ["input_1", "conv2d_5/kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "conv2d_1/Conv2D", "op": "Conv2D", "input": ["input_1", "conv2d_1/kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "conv2d_5/BiasAdd", "op": "BiasAdd", "input": ["conv2d_5/Conv2D", "conv2d_5/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_1/BiasAdd", "op": "BiasAdd", "input": ["conv2d_1/Conv2D", "conv2d_1/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "batch_normalization_5/FusedBatchNorm/Mul", "op": "Mul", "input": ["batch_normalization_5/FusedBatchNorm/Scaled", "conv2d_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/FusedBatchNorm/Mul", "op": "Mul", "input": ["batch_normalization_1/FusedBatchNorm/Scaled", "conv2d_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_5/FusedBatchNorm", "op": "Add", "input": ["batch_normalization_5/FusedBatchNorm/Mul", "batch_normalization_5/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_1/FusedBatchNorm", "op": "Add", "input": ["batch_normalization_1/FusedBatchNorm/Mul", "batch_normalization_1/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "max_pooling2d_1/MaxPool", "op": "MaxPool", "input": ["batch_normalization_5/FusedBatchNorm"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "activation_1/Relu", "op": "Relu", "input": ["batch_normalization_1/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_5/Tanh", "op": "Tanh", "input": ["max_pooling2d_1/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "average_pooling2d_1/AvgPool", "op": "AvgPool", "input": ["activation_1/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv2d_6/Conv2D", "op": "Conv2D", "input": ["activation_5/Tanh", "conv2d_6/kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "conv2d_13/Conv2D", "op": "Conv2D", "input": ["activation_5/Tanh", "conv2d_13/kernel"], "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "conv2d_2/Conv2D", "op": "Conv2D", "input": ["average_pooling2d_1/AvgPool", "conv2d_2/kernel"], "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "conv2d_14/Conv2D", "op": "Conv2D", "input": ["average_pooling2d_1/AvgPool", "conv2d_14/kernel"], "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "conv2d_6/BiasAdd", "op": "BiasAdd", "input": ["conv2d_6/Conv2D", "conv2d_6/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv2d_13/BiasAdd", "op": "BiasAdd", "input": ["conv2d_13/Conv2D", "conv2d_13/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv2d_2/BiasAdd", "op": "BiasAdd", "input": ["conv2d_2/Conv2D", "conv2d_2/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_14/BiasAdd", "op": "BiasAdd", "input": ["conv2d_14/Conv2D", "conv2d_14/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "batch_normalization_6/FusedBatchNorm/Mul", "op": "Mul", "input": ["batch_normalization_6/FusedBatchNorm/Scaled", "conv2d_6/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "max_pooling2d_5/MaxPool", "op": "MaxPool", "input": ["conv2d_13/BiasAdd"], "attr": {"padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "8", "8", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "8", "8", "1"]}}}}, {"name": "batch_normalization_2/FusedBatchNorm/Mul", "op": "Mul", "input": ["batch_normalization_2/FusedBatchNorm/Scaled", "conv2d_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_14/Relu", "op": "Relu", "input": ["conv2d_14/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_6/FusedBatchNorm", "op": "Add", "input": ["batch_normalization_6/FusedBatchNorm/Mul", "batch_normalization_6/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_13/Relu", "op": "Relu", "input": ["max_pooling2d_5/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_2/FusedBatchNorm", "op": "Add", "input": ["batch_normalization_2/FusedBatchNorm/Mul", "batch_normalization_2/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "average_pooling2d_5/AvgPool", "op": "AvgPool", "input": ["conv2d_14/Relu"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "8", "8", "1"]}}, "ksize": {"list": {"i": ["1", "8", "8", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "max_pooling2d_2/MaxPool", "op": "MaxPool", "input": ["batch_normalization_6/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "flatten_5/Shape", "op": "Shape", "input": ["conv2d_13/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "activation_2/Relu", "op": "Relu", "input": ["batch_normalization_2/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "flatten_6/Shape", "op": "Shape", "input": ["average_pooling2d_5/AvgPool"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "activation_6/Tanh", "op": "Tanh", "input": ["max_pooling2d_2/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "flatten_5/strided_slice", "op": "StridedSlice", "input": ["flatten_5/Shape", "flatten_1/strided_slice/stack", "flatten_1/strided_slice/stack_1", "flatten_1/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "average_pooling2d_2/AvgPool", "op": "AvgPool", "input": ["activation_2/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "flatten_6/strided_slice", "op": "StridedSlice", "input": ["flatten_6/Shape", "flatten_1/strided_slice/stack", "flatten_1/strided_slice/stack_1", "flatten_1/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_7/Conv2D", "op": "Conv2D", "input": ["activation_6/Tanh", "conv2d_7/kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "conv2d_11/Conv2D", "op": "Conv2D", "input": ["activation_6/Tanh", "conv2d_11/kernel"], "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "flatten_5/Reshape/shape", "op": "Pack", "input": ["flatten_5/strided_slice", "flatten_1/Reshape/shape/1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_3/Conv2D", "op": "Conv2D", "input": ["average_pooling2d_2/AvgPool", "conv2d_3/kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "conv2d_12/Conv2D", "op": "Conv2D", "input": ["average_pooling2d_2/AvgPool", "conv2d_12/kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "flatten_6/Reshape/shape", "op": "Pack", "input": ["flatten_6/strided_slice", "flatten_1/Reshape/shape/1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "conv2d_7/BiasAdd", "op": "BiasAdd", "input": ["conv2d_7/Conv2D", "conv2d_7/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv2d_11/BiasAdd", "op": "BiasAdd", "input": ["conv2d_11/Conv2D", "conv2d_11/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "flatten_5/Reshape", "op": "Reshape", "input": ["conv2d_13/Relu", "flatten_5/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "conv2d_3/BiasAdd", "op": "BiasAdd", "input": ["conv2d_3/Conv2D", "conv2d_3/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv2d_12/BiasAdd", "op": "BiasAdd", "input": ["conv2d_12/Conv2D", "conv2d_12/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "flatten_6/Reshape", "op": "Reshape", "input": ["average_pooling2d_5/AvgPool", "flatten_6/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "batch_normalization_7/FusedBatchNorm/Mul", "op": "Mul", "input": ["batch_normalization_7/FusedBatchNorm/Scaled", "conv2d_7/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "max_pooling2d_4/MaxPool", "op": "MaxPool", "input": ["conv2d_11/BiasAdd"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "4", "4", "1"]}}, "ksize": {"list": {"i": ["1", "4", "4", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}}}, {"name": "dense_7/MatMul", "op": "MatMul", "input": ["flatten_5/Reshape", "dense_7/kernel"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_3/FusedBatchNorm/Mul", "op": "Mul", "input": ["batch_normalization_3/FusedBatchNorm/Scaled", "conv2d_3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_12/Relu", "op": "Relu", "input": ["conv2d_12/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_8/MatMul", "op": "MatMul", "input": ["flatten_6/Reshape", "dense_8/kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "multiply_5/mul", "op": "Mul", "input": ["flatten_5/Reshape", "flatten_6/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_7/FusedBatchNorm", "op": "Add", "input": ["batch_normalization_7/FusedBatchNorm/Mul", "batch_normalization_7/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_11/Relu", "op": "Relu", "input": ["max_pooling2d_4/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_7/BiasAdd", "op": "BiasAdd", "input": ["dense_7/MatMul", "dense_7/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "batch_normalization_3/FusedBatchNorm", "op": "Add", "input": ["batch_normalization_3/FusedBatchNorm/Mul", "batch_normalization_3/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "average_pooling2d_4/AvgPool", "op": "AvgPool", "input": ["conv2d_12/Relu"], "attr": {"ksize": {"list": {"i": ["1", "4", "4", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "4", "4", "1"]}}}}, {"name": "dense_8/BiasAdd", "op": "BiasAdd", "input": ["dense_8/MatMul", "dense_8/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "delta_s3/MatMul", "op": "MatMul", "input": ["multiply_5/mul", "delta_s3/kernel"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "max_pooling2d_3/MaxPool", "op": "MaxPool", "input": ["batch_normalization_7/FusedBatchNorm"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "flatten_3/Shape", "op": "Shape", "input": ["conv2d_11/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dense_7/Relu", "op": "Relu", "input": ["dense_7/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_3/Relu", "op": "Relu", "input": ["batch_normalization_3/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "flatten_4/Shape", "op": "Shape", "input": ["average_pooling2d_4/AvgPool"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dense_8/Relu", "op": "Relu", "input": ["dense_8/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "delta_s3/BiasAdd", "op": "BiasAdd", "input": ["delta_s3/MatMul", "delta_s3/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "activation_7/Tanh", "op": "Tanh", "input": ["max_pooling2d_3/MaxPool"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "flatten_3/strided_slice", "op": "StridedSlice", "input": ["flatten_3/Shape", "flatten_1/strided_slice/stack", "flatten_1/strided_slice/stack_1", "flatten_1/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "average_pooling2d_3/AvgPool", "op": "AvgPool", "input": ["activation_3/Relu"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "flatten_4/strided_slice", "op": "StridedSlice", "input": ["flatten_4/Shape", "flatten_1/strided_slice/stack", "flatten_1/strided_slice/stack_1", "flatten_1/strided_slice/stack_1"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "multiply_6/mul", "op": "Mul", "input": ["dense_7/Relu", "dense_8/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "delta_s3/Tanh", "op": "Tanh", "input": ["delta_s3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_8/Conv2D", "op": "Conv2D", "input": ["activation_7/Tanh", "conv2d_8/kernel"], "attr": {"padding": {"s": "VkFMSUQ="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "flatten_3/Reshape/shape", "op": "Pack", "input": ["flatten_3/strided_slice", "flatten_1/Reshape/shape/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "conv2d_4/Conv2D", "op": "Conv2D", "input": ["average_pooling2d_3/AvgPool", "conv2d_4/kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "flatten_4/Reshape/shape", "op": "Pack", "input": ["flatten_4/strided_slice", "flatten_1/Reshape/shape/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "dense_9/MatMul", "op": "MatMul", "input": ["multiply_6/mul", "dense_9/kernel"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "pred_a/add_23", "op": "Add", "input": ["delta_s3/Tanh", "pred_a/add_17/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_8/BiasAdd", "op": "BiasAdd", "input": ["conv2d_8/Conv2D", "conv2d_8/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "flatten_3/Reshape", "op": "Reshape", "input": ["conv2d_11/Relu", "flatten_3/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "conv2d_4/BiasAdd", "op": "BiasAdd", "input": ["conv2d_4/Conv2D", "conv2d_4/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "flatten_4/Reshape", "op": "Reshape", "input": ["average_pooling2d_4/AvgPool", "flatten_4/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "dense_9/BiasAdd", "op": "BiasAdd", "input": ["dense_9/MatMul", "dense_9/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "pred_a/mul_32", "op": "Mul", "input": ["pred_a/add_23", "pred_a/mul_10/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_8/FusedBatchNorm/Mul", "op": "Mul", "input": ["batch_normalization_8/FusedBatchNorm/Scaled", "conv2d_8/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_4/MatMul", "op": "MatMul", "input": ["flatten_3/Reshape", "dense_4/kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "batch_normalization_4/FusedBatchNorm/Mul", "op": "Mul", "input": ["batch_normalization_4/FusedBatchNorm/Scaled", "conv2d_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_5/MatMul", "op": "MatMul", "input": ["flatten_4/Reshape", "dense_5/kernel"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "multiply_3/mul", "op": "Mul", "input": ["flatten_3/Reshape", "flatten_4/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_9/Relu", "op": "Relu", "input": ["dense_9/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "batch_normalization_8/FusedBatchNorm", "op": "Add", "input": ["batch_normalization_8/FusedBatchNorm/Mul", "batch_normalization_8/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_4/BiasAdd", "op": "BiasAdd", "input": ["dense_4/MatMul", "dense_4/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "batch_normalization_4/FusedBatchNorm", "op": "Add", "input": ["batch_normalization_4/FusedBatchNorm/Mul", "batch_normalization_4/FusedBatchNorm/Offset"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_5/BiasAdd", "op": "BiasAdd", "input": ["dense_5/MatMul", "dense_5/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "delta_s2/MatMul", "op": "MatMul", "input": ["multiply_3/mul", "delta_s2/kernel"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "local_delta_stage3/MatMul", "op": "MatMul", "input": ["dense_9/Relu", "local_delta_stage3/kernel"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "pred_age_stage3/MatMul", "op": "MatMul", "input": ["dense_9/Relu", "pred_age_stage3/kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "activation_8/Tanh", "op": "Tanh", "input": ["batch_normalization_8/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_4/Relu", "op": "Relu", "input": ["dense_4/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "activation_4/Relu", "op": "Relu", "input": ["batch_normalization_4/FusedBatchNorm"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_5/Relu", "op": "Relu", "input": ["dense_5/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "delta_s2/BiasAdd", "op": "BiasAdd", "input": ["delta_s2/MatMul", "delta_s2/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "local_delta_stage3/BiasAdd", "op": "BiasAdd", "input": ["local_delta_stage3/MatMul", "local_delta_stage3/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "pred_age_stage3/BiasAdd", "op": "BiasAdd", "input": ["pred_age_stage3/MatMul", "pred_age_stage3/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv2d_9/Conv2D", "op": "Conv2D", "input": ["activation_8/Tanh", "conv2d_9/kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "VkFMSUQ="}}}, {"name": "conv2d_10/Conv2D", "op": "Conv2D", "input": ["activation_4/Relu", "conv2d_10/kernel"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "multiply_4/mul", "op": "Mul", "input": ["dense_4/Relu", "dense_5/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "delta_s2/Tanh", "op": "Tanh", "input": ["delta_s2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "local_delta_stage3/Tanh", "op": "Tanh", "input": ["local_delta_stage3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pred_age_stage3/Relu", "op": "Relu", "input": ["pred_age_stage3/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_9/BiasAdd", "op": "BiasAdd", "input": ["conv2d_9/Conv2D", "conv2d_9/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "conv2d_10/BiasAdd", "op": "BiasAdd", "input": ["conv2d_10/Conv2D", "conv2d_10/bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "dense_6/MatMul", "op": "MatMul", "input": ["multiply_4/mul", "dense_6/kernel"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "pred_a/add_22", "op": "Add", "input": ["delta_s2/Tanh", "pred_a/add_17/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pred_a/strided_slice_15", "op": "StridedSlice", "input": ["local_delta_stage3/Tanh", "pred_a/strided_slice_15/stack", "pred_a/strided_slice_15/stack_1", "pred_a/strided_slice_15/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "2"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}}}, {"name": "pred_a/strided_slice_17", "op": "StridedSlice", "input": ["local_delta_stage3/Tanh", "pred_a/strided_slice_15/stack_1", "pred_a/strided_slice_17/stack_1", "pred_a/strided_slice_15/stack_2"], "attr": {"shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "pred_a/strided_slice_19", "op": "StridedSlice", "input": ["local_delta_stage3/Tanh", "pred_a/strided_slice_17/stack_1", "pred_a/strided_slice_19/stack_1", "pred_a/strided_slice_15/stack_2"], "attr": {"shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "pred_a/strided_slice_16", "op": "StridedSlice", "input": ["pred_age_stage3/Relu", "pred_a/strided_slice_15/stack", "pred_a/strided_slice_15/stack_1", "pred_a/strided_slice_15/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}}}, {"name": "pred_a/strided_slice_18", "op": "StridedSlice", "input": ["pred_age_stage3/Relu", "pred_a/strided_slice_15/stack_1", "pred_a/strided_slice_17/stack_1", "pred_a/strided_slice_15/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "2"}}}, {"name": "pred_a/strided_slice_20", "op": "StridedSlice", "input": ["pred_age_stage3/Relu", "pred_a/strided_slice_17/stack_1", "pred_a/strided_slice_19/stack_1", "pred_a/strided_slice_15/stack_2"], "attr": {"shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_9/Relu", "op": "Relu", "input": ["conv2d_9/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "conv2d_10/Relu", "op": "Relu", "input": ["conv2d_10/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_6/BiasAdd", "op": "BiasAdd", "input": ["dense_6/MatMul", "dense_6/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "pred_a/mul_30", "op": "Mul", "input": ["pred_a/add_22", "pred_a/mul_10/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pred_a/add_17", "op": "Add", "input": ["pred_a/add_17/x", "pred_a/strided_slice_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pred_a/add_19", "op": "Add", "input": ["pred_a/add_19/x", "pred_a/strided_slice_19"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pred_a/mul_22", "op": "Mul", "input": ["pred_a/strided_slice_15", "pred_a/strided_slice_16"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "flatten_1/Shape", "op": "Shape", "input": ["conv2d_9/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "flatten_2/Shape", "op": "Shape", "input": ["conv2d_10/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "dense_6/Relu", "op": "Relu", "input": ["dense_6/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pred_a/mul_24", "op": "Mul", "input": ["pred_a/add_17", "pred_a/strided_slice_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pred_a/mul_26", "op": "Mul", "input": ["pred_a/add_19", "pred_a/strided_slice_20"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "flatten_1/strided_slice", "op": "StridedSlice", "input": ["flatten_1/Shape", "flatten_1/strided_slice/stack", "flatten_1/strided_slice/stack_1", "flatten_1/strided_slice/stack_1"], "attr": {"shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, {"name": "flatten_2/strided_slice", "op": "StridedSlice", "input": ["flatten_2/Shape", "flatten_1/strided_slice/stack", "flatten_1/strided_slice/stack_1", "flatten_1/strided_slice/stack_1"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "local_delta_stage2/MatMul", "op": "MatMul", "input": ["dense_6/Relu", "local_delta_stage2/kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "pred_age_stage2/MatMul", "op": "MatMul", "input": ["dense_6/Relu", "pred_age_stage2/kernel"], "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "flatten_1/Reshape/shape", "op": "Pack", "input": ["flatten_1/strided_slice", "flatten_1/Reshape/shape/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "flatten_2/Reshape/shape", "op": "Pack", "input": ["flatten_2/strided_slice", "flatten_1/Reshape/shape/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "local_delta_stage2/BiasAdd", "op": "BiasAdd", "input": ["local_delta_stage2/MatMul", "local_delta_stage2/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "pred_age_stage2/BiasAdd", "op": "BiasAdd", "input": ["pred_age_stage2/MatMul", "pred_age_stage2/bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "flatten_1/Reshape", "op": "Reshape", "input": ["conv2d_9/Relu", "flatten_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "flatten_2/Reshape", "op": "Reshape", "input": ["conv2d_10/Relu", "flatten_2/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "local_delta_stage2/Tanh", "op": "Tanh", "input": ["local_delta_stage2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pred_age_stage2/Relu", "op": "Relu", "input": ["pred_age_stage2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "dense_1/MatMul", "op": "MatMul", "input": ["flatten_1/Reshape", "dense_1/kernel"], "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "dense_2/MatMul", "op": "MatMul", "input": ["flatten_2/Reshape", "dense_2/kernel"], "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "multiply_1/mul", "op": "Mul", "input": ["flatten_1/Reshape", "flatten_2/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "pred_a/strided_slice_9", "op": "StridedSlice", "input": ["local_delta_stage2/Tanh", "pred_a/strided_slice_15/stack", "pred_a/strided_slice_15/stack_1", "pred_a/strided_slice_15/stack_2"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}}}, {"name": "pred_a/strided_slice_11", "op": "StridedSlice", "input": ["local_delta_stage2/Tanh", "pred_a/strided_slice_15/stack_1", "pred_a/strided_slice_17/stack_1", "pred_a/strided_slice_15/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}}}, {"name": "pred_a/strided_slice_13", "op": "StridedSlice", "input": ["local_delta_stage2/Tanh", "pred_a/strided_slice_17/stack_1", "pred_a/strided_slice_19/stack_1", "pred_a/strided_slice_15/stack_2"], "attr": {"new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "2"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}}}, {"name": "pred_a/strided_slice_10", "op": "StridedSlice", "input": ["pred_age_stage2/Relu", "pred_a/strided_slice_15/stack", 